In [ ]:
pip install pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.11/dist-packages (2.2.2)
Requirement already satisfied: numpy>=1.23.2 in /usr/local/lib/python3.11/dist-packages (from pandas) (2.0.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /usr/local/lib/python3.11/dist-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /usr/local/lib/python3.11/dist-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /usr/local/lib/python3.11/dist-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.11/dist-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
ser=pd.Series()
print("Pandas Series: ",ser)
data=np.array(['a','b','c','d'])
ser=pd.Series(data)
print("Pandas Series:\n ",ser)

Pandas Series:  Series([], dtype: object)
Pandas Series:
  0    a
1    b
2    c
3    d
dtype: object

In [ ]:
df=pd.DataFrame()
print(df)
lst=['a','b','c','d']
df=pd.DataFrame(lst)
print(df)

Empty DataFrame
Columns: []
Index: []
   0
0  a
1  b
2  c
3  d

In [ ]:
data={'Name':['Tom','Jack','Steve','Ricky'],'Age':[28,34,29,42]}
df=pd.DataFrame(data)
print(df)

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [ ]:
print(df.index)

RangeIndex(start=0, stop=4, step=1)

In [ ]:
df_with_index=df.set_index('Name')

In [ ]:
print(df_with_index)

       Age
Name
Tom     28
Jack    34
Steve   29
Ricky   42

In [ ]:
df_reset=df.reset_index()
print(df)

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [ ]:
row=df_reset.loc[0]
print(row)

index      0
Name     Tom
Age       28
Name: 0, dtype: object

In [ ]:
df_new=df.set_index('Age')
print(df_new)

      Name
Age
28     Tom
34    Jack
29   Steve
42   Ricky

In [ ]:
data={'Name': ['John', 'Alice', 'Bob', 'Eve', 'Charlie'],
        'Age': [25, 30, 22, 35, 28],
        'Gender': ['Male', 'Female', 'Male', 'Female', 'Male'],
        'Salary': [50000, 55000, 40000, 70000, 48000]}
df=pd.DataFrame(data)
print(df)

      Name  Age  Gender  Salary
0     John   25    Male   50000
1    Alice   30  Female   55000
2      Bob   22    Male   40000
3      Eve   35  Female   70000
4  Charlie   28    Male   48000

In [ ]:
print(df['Age'])

0    25
1    30
2    22
3    35
4    28
Name: Age, dtype: int64

In [ ]:
print(df[['Age','Gender']])

   Age  Gender
0   25    Male
1   30  Female
2   22    Male
3   35  Female
4   28    Male

In [ ]:
print(df)

      Name  Age  Gender  Salary
0     John   25    Male   50000
1    Alice   30  Female   55000
2      Bob   22    Male   40000
3      Eve   35  Female   70000
4  Charlie   28    Male   48000

In [ ]:

print(df.iloc[1])

Name       Alice
Age           30
Gender    Female
Salary     55000
Name: 1, dtype: object

In [ ]:
print(df.loc[0:2,['Name','Age']])

    Name  Age
0   John   25
1  Alice   30
2    Bob   22

In [ ]:
print(df.head(3))

    Name  Age  Gender  Salary
0   John   25    Male   50000
1  Alice   30  Female   55000
2    Bob   22    Male   40000

In [ ]:
print(df.iloc[1], df.iloc[2])

Name       Alice
Age           30
Gender    Female
Salary     55000
Name: 1, dtype: object Name        Bob
Age          22
Gender     Male
Salary    40000
Name: 2, dtype: object

In [ ]:
print(df.loc[:,['Name','Age']])

      Name  Age
0     John   25
1    Alice   30
2      Bob   22
3      Eve   35
4  Charlie   28

In [ ]:
print(df[df['Age']>25].iloc[:,:])

      Name  Age  Gender  Salary
1    Alice   30  Female   55000
3      Eve   35  Female   70000
4  Charlie   28    Male   48000

In [ ]:
print(df)

      Name  Age  Gender  Salary
0     John   25    Male   50000
1    Alice   30  Female   55000
2      Bob   22    Male   40000
3      Eve   35  Female   70000
4  Charlie   28    Male   48000

In [ ]:
display(df.loc[(df['Age']>20)&(df['Salary']<50000)&(df['Name'].str.startswith('B')),['Name','Salary']])

  Name  Salary
2  Bob   40000

In [ ]:
display(df.query('Age>20 and Salary<50000 and Name.str.startswith("B").values'))

  Name  Age Gender  Salary
2  Bob   22   Male   40000